---
kind: method
id: M:Autodesk.Revit.DB.DimensionSegment.ResetTextPosition
source: html/36a8d542-a567-80de-6da7-28b28af0aa4b.htm
---
# Autodesk.Revit.DB.DimensionSegment.ResetTextPosition Method

Resets the text position of the segment to the initial position determined by its type and parameters.

## Syntax (C#)
```csharp
public void ResetTextPosition()
```

## Remarks
The initial point is the text location when dimension is created.